package com.ivanilov.wildapp.utils

object Constants {

    const val GROUP_TABLE = "Group"
    const val GROUP_ITEM_NAME = "name"
    const val GROUP_ITEM_AVAILABLE = "avalible"

    const val PRODUCT_TABLE = "Products"
    const val PRODUCT_ITEM_NAME = "name"
    const val PRODUCT_ITEM_GROUP = "group"
    const val PRODUCT_ITEM_DESCRIPTION = "description"
    const val PRODUCT_ITEM_COST = "cost"
    const val PRODUCT_ITEM_VOLUME = "volume"
    const val PRODUCT_ITEM_ADD = "addName"
    const val PRODUCT_ITEM_ADD_OPTION = "addOption"
    const val PRODUCT_ITEM_ADD_COST_OPTION = "addCostOption"
    const val PRODUCT_ITEM_AVAILABLE = "avalible"
    const val PRODUCT_ITEM_IMAGE_URL = "imageUrl"

    const val SIGN_IN_TEXT = "Для заказа напитков необходимо зерегестрироваться"
    const val SIGN_IN_TEXT_BUTTON = "Если у вас еще нет аккаунта, вы можете"
    const val CHECK_IN_TEXT_BUTTON = "Если у вас уже есть аккаунт, вы можете"

    const val USER_TABLE = "Users"

    const val ORDER_TABLE = "Orders"
    const val TEXT_ABOUT_US = "Wild Coffee в вашем телефоне.\n" +
            "\n" +
            "Мы создали это приложение, чтобы вам было максимально удобно заказывать кофе у нас. ❤️\n" +
            "\n" +
            "Чтобы не тратить время в очереди и не звонить бариста, просто сделайте предзаказ в приложении. Выберете любое удобное для вас время и заберите любимые напитки!\uD83C\uDF3F\n" +
            "\n" +
            "Мы сделаем все возможное, чтобы приготовить заказ прямо к вашему приходу. Но если у нас в это время будет много заказов, то ваш попадет в очередь, и мы будем делать всё по порядку.\uD83D\uDE0C\n"

    const val TEXT_USER_AGREEMENT = "ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ,  ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ, ПРАВИЛА ОПЛАТЫ\n" +
            "\n" +
            "\n" +
            "ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ\n" +
            "ООО \"Супер88\" (далее — Wild Coffee),  соблюдает права пользователей (далее – Пользователи или Вы) на неразглашение личной информации и в полной мере принимает на себя обязательства по сохранению личных данных, переданных в адрес компании. Компания Wild Coffee уверена, что Пользователи (включая зарегистрированных) ее продукции и услуг имеют полное право знать о политике и способах обработки информации, получаемой ею во время, получения доступа и использования ее Приложения «Wild Coffee» (далее — Приложение), а также в ходе использования Услуг (определение которых можно найти в Лицензионном  соглашении с компанией Wild Coffee (далее — ЛС).\n" +
            "СОГЛАСИЕ\n" +
            "Пожалуйста, внимательно ознакомьтесь со следующей информацией:\n" +
            "Используя услуги, получая доступ к приложению, предоставляя информацию посредством указанного Приложения, регистрируя учетную запись/профиль в приложении, Вы соглашаетесь с правилами, описанными в тексте политики конфиденциальности, включая те, которые имеют отношение к сбору и обработке ваших личных персональных данных (как указано ниже) (далее — политика конфиденциальности).\n" +
            "СБОР ИНФОРМАЦИИ\n" +
            "Компания Wild Coffee может собирать анонимную неличную информацию (далее – Неличная информация), предоставленную Пользователями. К неличной информации относится любая нескрываемая информация, которая становится доступной компании Wild Coffee во время непосредственного использования Приложения. Неличная информация может содержать, помимо прочего, данные об идентификации браузера Пользователя, так же как и оперативной системы, порядок посещения страниц Пользователем, время и дату подключения Пользователя и т.п. Данная информация собирается для ведения статистики и применяется для улучшения качества Услуг, предоставляемых компанией, а также усовершенствования интерфейса Приложения.\n" +
            "Компания может собирать Личную информацию (Персональные данные), добровольно и сознательно предоставляемую Пользователями во время создания Учетной записи/Профиля через приложение или регистрации иным способом для получения Услуг. «Личная информация» означает персональные данные, такие как фамилия и имя, номер мобильного телефона и адрес электронной почты. Кроме того, чтобы наиболее эффективно предоставлять Услуги, компания собирает информацию о вашем местонахождении при помощи GPS-навигатора, beacon-устройств, которая (информация) может быть идентифицирована и передана исполнителям услуг.\n" +
            "Во избежание недоразумений любая Неличная информация, имеющая отношение к Личной информации или связанная с ней, будет рассматриваться как Личная до тех пор, пока существует такая связь либо отношение.\n" +
            "ИСПОЛЬЗОВАНИЕ ИНФОРМАЦИИ\n" +
            "Компания Wild Coffee может использовать Личную информацию, чтобы:\n" +
            "1) предоставлять Услуги;\n" +
            "2) отправлять сообщения Пользователям относительно Услуг (например, касающиеся статуса готовности их заказа);\n" +
            "3) предоставлять пользователям поддержку;\n" +
            "4) отправлять рекламные материалы для целевой аудитории и сообщать о льготных предложениях (далее – Рекламные материалы);\n" +
            "5) идентифицировать пользователя при получении заказа;\n" +
            "РАЗГЛАШЕНИЕ ИНФОРМАЦИИ\n" +
            "Компании Wild Coffee обязуются не разглашать Личную информацию, полученную ими от третьих лиц.\n" +
            "Несмотря на это, они могут раскрывать подобную информацию в следующих случаях:\n" +
            "1. для соблюдения требований применимого закона, постановления, судебного процесса, судебной повестки или требований правительства;\n" +
            "2. для обеспечения соблюдения данной Политики конфиденциальности или ЛС, включая исследование потенциальных нарушений указанных регламентов;\n" +
            "3. для обнаружения, предотвращения или решения вопросов, связанных с обманом, безопасностью или техническими аспектами;\n" +
            "4. для ответов на просьбы Пользователей о поддержке;\n" +
            "5. для реагирования на претензии относительно того, что то или иное информационное наполнение нарушает права третьих лиц;\n" +
            "6. для реагирования на претензии относительно того, что контактная информация (например, имя, телефон и т.п.) третьей стороны были опубликованы или переданы без ее согласия или в качестве оскорбления;\n" +
            "7. для защиты прав, собственности или личной безопасности компании Wild Coffee, их Пользователей или широкой публики;\n" +
            "8. если в компании меняется система управления, включая случаи слияния, поглощения или покупки всего имущества компании либо значительной его части;\n" +
            "9. согласно вашему ясно выраженному предварительному разрешению.\n" +
            "Во избежание недоразумений компания может передавать и разглашать Не личную информацию третьим лицам по собственному усмотрению.\n" +
            "ИЗМЕНЕНИЕ ЛИЧНОЙ ИНФОРМАЦИИ\n" +
            "Пользователи могут получать доступ к своей Учетной записи/к своему Профилю и вносить изменения в графу с Личной информацией. Информацию о том, как отправить запрос на изменение любой Личной информации, предоставленной вами Wild Coffee, обратитесь по электронному адресу ooo.super88@yandex.ru\n" +
            "БЕЗОПАСНОСТЬ\n" +
            "Для обеспечения и поддержания безопасности Личной информации пользователей применяются стандартные отраслевые технологии и методы, чтобы гарантировать безопасность пользовательских данных, а также предотвратить их несанкционированное использование. Среди других способов пользовательская Личная информация защищена:\n" +
            "- номер телефона, имя и фамилия клиента на уровне операционной системы мобильного телефона;\n" +
            "- данные необходимые для проведения платежей хранятся с помощью функции KeyChain c использованием 256-битного шифрования AES;\n" +
            "- данные о заказах Пользователей хранятся на удаленном сервере и защищены стандартными средствами хостинг провайдера;\n" +
            "Несмотря на это, компании не могут гарантировать абсолютной защиты данных. Пользователи должны держать в секрете номер своей Учетной записи/Профиля и иную информацию о ней.\n" +
            "ИЗМЕНЕНИЯ\n" +
            "Положения Политики конфиденциальности являются неотъемлемой частью этого Приложения и любой информации, размещенной в нем, и не могут рассматриваться отдельно от Лицензионного соглашения.\n" +
            "Компания Wild Coffee оставляет за собой право менять Политику конфиденциальности в любое время. В случае значительных изменений компания может уведомить об этом Пользователей. Изменения к данной Политике конфиденциальности вступают в силу с момента опубликования. Продолжая пользоваться Приложением после даты выхода новой версии Политики Конфиденциальности, Вы соглашаетесь на внесенные изменения и соблюдение правил, основанных на таких изменениях.\n" +
            "ПРАВИЛА ОПЛАТЫ\n" +
            "Ознакомиться с правила оплаты можно ниже.\n" +
            "\n" +
            "\n" +
            "ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ\n" +
            "1. ИНФОРМАЦИЯ О ПРАВООБЛАДАТЕЛЯХ\n" +
            "ООО \"Супер88\"\n" +
            "2. ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ С КОНЕЧНЫМ ПОЛЬЗОВАТЕЛЕМ\n" +
            "Данная информация определяет условия и правила использования Приложения, а также определяет правила и условия пользования любым лицом возможностями, предоставляемыми данным Приложением.\n" +
            "Устанавливая Приложение на свое мобильное устройство Вы тем самым соглашаетесь в безусловном порядке со всеми правилами, условиями и информацией, размещенными в приложении, в том числе, но не ограничиваясь: настоящим лицензионным соглашением, политикой конфиденциальности и условиями оплаты.\n" +
            "Если Вы не согласны с настоящим соглашением, а также условиями и положениями политики конфиденциальности и правилами пользования Приложением, не хотите их соблюдать, не устанавливайте Приложение, незамедлительно удалите его с мобильного телефона и не пользуйтесь Приложением. В случае, если Вы по каким-либо причинам не согласны с вышеприведенными правилами или условиями, то это означает Вашу обязанность по удалению Приложения со своего мобильного устройства. В противном случае, Вы будете считаться согласным в безусловном порядке со всеми правилами и условиями.\n" +
            "3. ПРАВО СОБСТВЕННОСТИ\n" +
            "Единоличным владельцем Приложения и документации, имеющей отношение к нему, является Wild Coffee. Любые права на интеллектуальную собственность (включая, помимо прочего, авторское право, коммерческую тайну, торговые марки, патенты и т.п.), вытекающие из Приложения, заключенные в нем, имеющие отношение к нему, связанные с ним или закрепленные за ним, принадлежат Wild Coffee. Данное Соглашение не предусматривает передачу имущественных прав на Приложение или его компоненты, но предоставляет ограниченное право на использование Приложения, которое может быть отозвано в соответствии с условиями Соглашения. Ни одно из положений данного Соглашения не может рассматриваться как отказ Wild Coffee, от своих прав на интеллектуальную собственность, в какой бы то ни было юрисдикции.\n" +
            "4. ЛИЦЕНЗИЯ\n" +
            "Компания Wild Coffee предоставляет вам, а вы принимаете персональную неисключительную некоммерческую ограниченную лицензию без права передачи, сублицензирования, которая может быть в любой момент аннулирована, на использование Приложения в мобильном телефоне, которым вы владеете или распоряжаетесь, в соответствии с условиями, изложенными в тексте настоящего Соглашения.\n" +
            "Компания оставляет за собой все права, которые могут быть непрямо выражены в этом Соглашении.\n" +
            "Запрещенные способы использования:\n" +
            "Если в тексте настоящих условий специально не указано иное, то вы не можете без предварительного письменного согласия компании Wild Coffee\n" +
            "1) использовать, модифицировать, встраивать в другое программное обеспечение или объединять с ним, создавать переработанную версию любой части Приложения;\n" +
            "2) продавать, выдавать лицензии (сублицензии), отдавать в аренду, переуступать, передавать, отдавать в залог, разделять права по настоящему Соглашению третьим лицам;\n" +
            "3) копировать, распространять или воспроизводить Приложение в интересах третьих лиц;\n" +
            "4) обнародовать результаты какого-либо сопоставительного анализа касательно Приложения, использовать упомянутые результаты для вашей собственной конкурирующей деятельности по разработке программного обеспечения;\n" +
            "5) модифицировать, дизассемблировать, декомпилировать, разбирать на составляющие коды, перерабатывать или усовершенствовать Приложение, пытаться получить исходный текст/код программы Приложения.\n" +
            "5. ОБСЛУЖИВАНИЕ И ПОДДЕРЖКА\n" +
            "Компания Wild Coffee по данному Соглашению не обязана предоставлять поддержку, обслуживание, обновления, модификации и новые версии Приложения.\n" +
            "Однако она может время от времени выпускать обновления для Приложения и автоматически путем электронной коммуникации обновлять его версию, установленную в вашем мобильном телефоне. Вы даете согласие на такое автоматическое обновление, а также принимаете то, что условия и положения данного Соглашения будут иметь силу для будущих указанных обновлений.\n" +
            "6. ОТКАЗ ОТ ГАРАНТИЙНЫХ ОБЯЗАТЕЛЬСТВ\n" +
            "Приложение предоставляется без гарантии качества, не предполагает каких-либо гарантий, прямо выраженных или подразумеваемых. Компания Wild Coffee не гарантирует, что приложение будет соответствовать вашим требованиям, а также что его работа будет бесперебойной и безошибочной, а также что его работа будет соответствовать Вашему представлению о его должной работе..\n" +
            "В установленных законом случаях компании Wild Coffee открыто заявляют об отказе от любых прямых гарантий, включая, помимо прочего, гарантию чистоты прав собственности и отсутствия нарушения прав, а также от любых подразумеваемых гарантий, включая (но не ограничиваясь) косвенные гарантии коммерческой пригодности и пригодности для определенного применения. Компания Wild Coffee не несут ответственности за точность, полноту, применимость или надежность результатов, полученных в ходе использования приложения или каких-либо данных и информации, загруженной либо иным способом полученной посредством использования приложения. Вы принимаете на себя ответственность загружать, иным способом получать информацию через приложение на собственный риск и по собственному усмотрению, при этом к компании Wild Coffee не могут быть предъявлены претензии относительно ущерба, полученного вами или в отношении вашей собственности.\n" +
            "7. ОТКАЗ ОТ ОТВЕТСТВЕННОСТИ\n" +
            "Компания Wild Coffee не несет ответственности ни в силу договора, ни вследствие правонарушения (включая небрежность), а также в иных случаях перед Вами или третьими лицами за любой ущерб или убытки (включая косвенные, фактические, последующие), а также, помимо прочего, какой-либо ущерб или убытки в отношении дохода от коммерческой деятельности, неполученной прибыли (упущенной выгоды), деловой репутации, поврежденных или утраченных данных либо документации, понесенные тем или иным лицом вследствие или в связи с использованием Приложения, даже если компаниям стало известно о возможности возникновения такого ущерба.\n" +
            "8. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ\n" +
            "Если, несмотря на условия настоящего соглашения, компания Wild Coffee будет признана ответственной за ущерб, сумма возмещения не будет превышать ста долларов США (\$100).\n" +
            "9. ОКОНЧАНИЕ СРОКА ДЕЙСТВИЯ ЛИЦЕНЗИИ\n" +
            "Компания Wild Coffee может прекратить действие выданной лицензии в любое время и по любой причине. Помимо этого, нарушение вами условий настоящего Соглашения приведет к аннулированию вашей лицензии и самого Соглашения. После истечения срока действия Соглашения с компанией Wild Coffee:\n" +
            "1. лицензия, предоставляемая по нему, потеряет действительность, и вы вынуждены будете прекратить пользоваться Приложением;\n" +
            "2. вы должны будете незамедлительно вернуть компаниям Wild Coffee все материальное имущество, представляющее собой права компании Wild Coffee на интеллектуальную собственность, а также все копии таковой и/или сотрете/удалите любую такую информацию, хранимую в электронном виде. Пункты 1, 3, 5-10 не теряют силы и после окончания действия настоящего Соглашения.\n" +
            "10. ПРИМЕНИМОЕ ПРАВО\n" +
            "Настоящее соглашение будет истолковываться и регулироваться в соответствии с законодательством Российской Федерации (за исключением случаев, когда правовые нормы предусматривают иное), а компетентные суды города Томска будут обладать исключительной юрисдикцией в решении любых споров или конфликтов, возникающих в связи с настоящим Соглашением.\n" +
            "Применение Конвенции ООН о договорах международной купле-продаже товаров явным образом исключается.\n" +
            "11. ОСВОБОЖДЕНИЕ ОТ ОТВЕТСТВЕННОСТИ\n" +
            "Вы обязуетесь защищать права, освобождать от ответственности, обеспечивать не причинение ущерба компании Wild Coffee, ее директорам, служащим, лицензиарам, работникам и представителям в связи с любыми претензиями, ущербом, убытками, затратами, долговыми обязательствами и расходами (включая, помимо прочего, оплату юридических услуг), возникшими вследствие любого нарушения условий этого Соглашения.\n" +
            "12. ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ (ПО) ТРЕТЬИХ ЛИЦ\n" +
            "Если Приложение содержит какое-либо программное обеспечение третьих лиц, такое ПО поставляется без гарантий качества, а его использование регулируется условиями и ограничениями, установленными упомянутыми третьими сторонами.\n" +
            "13. ИНФОРМАЦИЯ О ПРИЛОЖЕНИИ\n" +
            "Используя Приложение, Вы получаете возможность:\n" +
            "- получать список меню с ценами кофеен сети Wild Coffee;\n" +
            "- заказа кофе и напитков в сети кофеен Wild Coffee к определенному времени с возможностью оплаты банковской картой или наличными при получении;\n" +
            "Для корректной работы Приложения, а также во избежание претензий, Вам необходимо заполнить все поля во вкладке «Профиль», а именно: Имя и Номер телефона.\n" +
            "Используя Приложение, Вы делаете свой заказ, выбирая из предложенных позиций, разбитых на категории, необходимую Вам. На экране заказа вводите всю необходимую информацию, а именно:\n" +
            "- указываете промежуток времени, по истечении которого Ваш заказ должен быть готов\n" +
            "- оставляете какой-либо комментарий (в случае необходимости)\n" +
            "При нажатии кнопки “Заказать” Вы тем самым подтверждаете Ваше согласие со всеми условиями предоставления услуги, а также Ваш отказ от претензий в случае, если исполнение заказа не соответствует или не будет соответствовать Вашему представлению о должном исполнении.\n" +
            "В Приложении предусмотрено 2 способа оплаты Вашего заказа:\n" +
            "1) оплата наличными непосредственно при получении заказа\n" +
            "2) оплата банковской картой непосредственно при получении заказа\n" +
            "Компания Wild Coffee предоставляет исключительные права пользования Приложением и ни при каких обстоятельствах не оказывает и не будет оказывать иные услуги, связанные с деятельностью компании Wild Coffee, равно как и не несет и не будет нести какую-либо ответственность за оказываемые Wild Coffee услуги. Договор купле-продажи заключается непосредственно между Вами и Wild Coffee. В соответствии с действующим законодательством ответственность, которая может быть предусмотрена вследствие неисполнения либо ненадлежащего исполнения оказываемой услуги, в том числе при предоставлении информации об услуге, условиях оказания услуги, тарифах и ценах, а также непосредственно оказании услуги, ее безопасности, причинении ущерба при оказании услуги несет исключительно исполнитель. Вы имеете право предъявить ваши претензии и требования непосредственно исполнителю.\n" +
            "При пользовании Приложением Вы подтверждаете, что являетесь законным владельцем мобильного телефона, на котором установлено Приложение, а также надлежаще зарегистрированным и законным пользователем услуг подвижной радиотелефонной связи или телематических услуг, позволяющих использовать возможности передачи данных для использования Приложения и Вашей идентификации как пользователя Приложения. Также, Вы безусловно соглашаетесь на получение сервисных sms-сообщений, необходимых для реализации функционала Приложения.\n" +
            "14. ИНФОРМАЦИОННОЕ СОПРОВОЖДЕНИЕ\n" +
            "Wild Coffee вправе информировать Вас о порядке и способах использования Приложения, о проводимых Wild Coffee маркетинговых, рекламных и иных мероприятиях, об условиях приобретения и потребления услуг третьих лиц с использованием Приложения, путем направления сообщений, в том числе содержащих рекламу, на мобильный телефон, в том числе с использованием сети связи, любым доступным Wild Coffee способом.\n" +
            "Принятие условий настоящего лицензионного соглашения означает Ваше безусловное согласие со всеми его разделами, указанными правами, принадлежащими Wild Coffee.\n" +
            "\n" +
            "\n" +
            "ПРАВИЛА ОПЛАТЫ\n" +
            "1. ИСПОЛЬЗУЕМЫЕ ТЕРМИНЫ\n" +
            "Банк - кредитная организация, которая имеет исключительное право осуществлять в совокупности следующие банковские операции: привлечение во вклады денежных средств физических и юридических лиц, размещение указанных средств от своего имени и за свой счет на условиях возвратности, платности, срочности, открытие и ведение банковских счетов физических и юридических лиц\n" +
            "Банковская карта - банковская карта международной платежной системы MasterCard, Visa.\n" +
            "Wild Coffee – ООО \"Супер88\" ,\n" +
            "юридический адрес: 643059, Томская обл., г. Томск, ул. Интернационалистов, д. 7, кв. 77\n" +
            "фактический адрес: Томская обл. г. Томск ул. Розы Люксембург 26\n" +
            "ИНН 7017316118,\n" +
            "р/с 40702810164000092211\n" +
            "в Томском Отделении №8616 Сбербанк России ПАО\n" +
            "БИК 046902606\n" +
            "Кор. Счет 30101810800000000606\n" +
            "ОКВЭД 56.30 \n" +
            "ОКПО 28826552\n" +
            "Тел +7 (3822) 23-12-66\n" +
            "Email: ooo.super88@yandex.ru\n" +
            "Клиент – физическое лицо, которому оказана Услуга\n" +
            "Международная платежная система - международные платежные системы MasterCard, Visa. Исходя из контекста настоящих Условий определяются в зависимости от принадлежности Банковской карты Клиента к определенной международной платежной системе.\n" +
            "Условия – настоящие Условия оплаты Услуг\n" +
            "2. ОБЩИЕ ПОЛОЖЕНИЯ\n" +
            "Клиент имеет возможность посредством приложения заказать Услуги. При этом договор купли-продажи заключается и обязанными сторонами по нему непосредственно становятся Wild Coffee и Клиент.\n" +
            "Оплата Услуг производится по тарифам Wild Coffee.\n" +
            "Клиент по условиям договора купли-продажи и в соответствии с действующим законодательством имеет обязанность по оплате оказанных ему Услуг. Оплата посредством передачи наличных денежных средств осуществляется Клиентом путем непосредственной передачи наличных денежных средств продавцу/бариста, осуществившему оказание Услуги, и данными Условиями не регулируется.\n" +
            "При наличии технической возможности осуществления расчетов за Услуги посредством использования Банковских карт Клиент имеет право произвести оплату за предоставленные Услуги посредством использования своей Банковской карты.\n" +
            "При этом, Wild Coffee осуществляет информационное и технологическое взаимодействие для обеспечения приема платежей посредством Банковских карт, и осуществляет сбор денежных средств причитающихся по оказанным Услугам.\n" +
            "При осуществлении платежей посредством использования Банковских карт Клиент обязан соблюдать установленные правила и требования международных платежных систем, а также банков, эмитировавших Банковские карты Клиента, регулирующих осуществление платежей с использованием Банковских карт.\n" +
            "Осуществление безналичных расчетов с использованием Банковских карт осуществляется Банком. Wild Coffee отвечает исключительно за правильность определения стоимости подлежащей оплате Услуг и доведения указанной информации до Банка.\n" +
            "Настоящие Условия являются публичной офертой в соответствии со ст.435 и ч.2 ст.437 ГК РФ. Соблюдая требования к обеспечению возможности оплаты Услуг посредством Банковских карт Клиента, указанные в п.3. настоящих Условий и/или производя оплату Услуг посредством использования Банковских карт, Клиент, безусловно и безоговорочно принимает и соглашается с настоящим Условиями.\n" +
            "3. ТРЕБОВАНИЯ\n" +
            "Для обеспечения возможности осуществления расчетов за оказанные Услуги Клиент обязан:\n" +
            "- установить на свое личное мобильное устройство (телефон, смартфон, и т.п.), работающих под операционными системами iOs или Android, приложение (программу) «Wild Coffee». \n" +
            "- авторизоваться в системе использую свое имя и номер телефона.\n" +
            "4. ПОРЯДОК ОПЛАТЫ\n" +
            "Оплата оказанных Услуг допускается при соблюдения Клиентом Требований  Лицензионного соглашении.\n" +
            "Для корректной работы Приложения, а также во избежание претензий, Вам необходимо заполнить все поля во вкладке «Профиль», а именно: Имя и номер телефона. Используя Приложение, Вы делаете свой заказ, выбирая из предложенных позиций, разбитых на категории, необходимую Вам. На экране заказа вводите всю необходимую информацию, а именно:\n" +
            "- указываете промежуток времени, по истечении которого Ваш заказ должен быть готов\n" +
            "- оставляете какой-либо комментарий (в случае необходимости)\n" +
            "При нажатии кнопки “Заказать” Вы тем самым подтверждаете Ваше согласие со всеми условиями предоставления услуги, а также Ваш отказ от претензий в случае, если исполнение заказа не соответствует или не будет соответствовать Вашему представлению о должном исполнении.\n" +
            "В Приложении предусмотрено 2 способа оплаты Вашего заказа:\n" +
            "1) оплата наличными непосредственно при получении заказа\n" +
            "2) оплата с помощью банковской карты, при получении заказа.\n" +
            "4.1. Выдача заказа\n" +
            "При получении Вашего заказа Вам необходимо сообщить служащему Wild Cofee/бариста ваше имя и номер телефона (при необходимости).\n" +
            "5. ВОЗВРАТ ПЛАТЕЖЕЙ\n" +
            "Порядок возврата регулируется правилами международных платежных систем.\n" +
            "Для возврата денежных средств на банковскую карту Заказчику необходимо обратиться к Wild Coffee по телефону +7 (3822) 23-12-66 и при необходимости заполнить «Заявление о возврате денежных средств», которое высылается по требованию Компанией на электронный адрес Заказчика, и оправить его вместе с приложением копии паспорта по адресу: ooo.super88@yandex.ru.\n" +
            "Возврат денежных средств будет осуществлен на банковский счет Заказчика, указанный в заявлении, в течение 21 (двадцати одного) рабочего дня со дня обращения в Компанию. Срок рассмотрения Заявления о возврате 5 рабочих дней, с момента обращения. Для возврата средств необходимо прийти в Компанию по Фактическому Адресу.\n" +
            "Покупатель вправе задать все возникшие вопросы Продавцу по телефону: +7 (3822) 23-12-66.\n" +
            "6. ГАРАНТИИ\n" +
            "Wild Coffee не несет какую-либо ответственность за любой возможный ущерб, причиненный Клиенту вследствие ненадлежащего оказания Услуги.\n" +
            "Coffee не несет ответственности за работоспособность и обеспечение сохранности и безопасности передаваемой информации при обеспечении и проведении платежей посредством Банковских карт Клиента, в том числе за действия Банка и международных платежных систем, банков и иных участников расчетов.\n" +
            "Все взаимоотношения в части проведения расчетов с использованием Банковских карт регулируются обязательными для Клиента условиями международных платежных систем и договорами Клиента с банком, эмитировавшим Банковскую карту Клиента.\n" +
            "Клиент обязуется не передавать третьим лицам, свое личное мобильное устройство (телефон, смартфон, и т.п.), с установленным приложением (программой). В\n" +
            "7. КОНФИДЕНЦИАЛЬНОСТЬ\n" +
            "Принимая настоящие Условия Клиент подтверждает, что он ознакомился и безусловно подтверждает свое согласие с правилами, описанными в тексте политики конфиденциальности, включая те, которые имеют отношение к сбору и обработке ваших личных данных.\n" +
            "8. ПРОЧИЕ УСЛОВИЯ\n" +
            "К отношениям между Клиентом и Wild Coffee применяется законодательство Российской Федерации. В случае возникновения вопросов и претензий со стороны Клиента он должен обратиться в Wild Coffee по телефону +7 (3822) 23-12-66 или по электронной почте ooo.super88@yandex.ru.\n" +
            "Все возникающее споры стороны будут стараться решить путем переговоров, при недостижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством РФ.\n" +
            "Признание судом недействительности какого-либо положения настоящих Условий и правил не влечет за собой недействительность остальных положений."


    const val ERROR_PHONE_NUMBER_WRONG_FORMAT = "Пожалуйста, введите ваш номер телефона"
    const val ERROR_PLEASE_INPUT_YOUR_NAME = "Пожалуйста, введите ваше имя"
    const val ERROR_PLEASE_INPUT_YOUR_PHONE_NUMBER = "Пожалуйста, введите номер телефона"

    const val ERROR_USER_DO_NOT_EXIST = "Пользователя с таким номером не существует, пожалуйста зарегестрируйтесь"






}